Repository: 17jlee/VLM_UI_testing
Catalog: Localizable.xcstrings
Source language: en
Languages: ar, de, es, fr, he

source: Another Section With A Ridiculously Long Header That Will Probably Wrap
ar: قسم آخر برأس طويل بشكل سخيف من المحتمل أن يلتف
de: Ein weiterer Abschnitt mit einer lächerlich langen Überschrift, die wahrscheinlich umbricht
es: Otra sección con un encabezado ridículamente largo que probablemente se ajustará
fr: Une autre section avec un en-tête ridiculement long qui va probablement s'enrouler
he: מדור נוסף עם כותרת מגוחכת באורכה שכנראה תגלוש

source: Another Very Long Row Title To See If The Text Gets Truncated Or Wrapped Depending On The Device Size (Row #%lld)
ar: عنوان صف طويل جداً آخر لمعرفة ما إذا كان النص سيتم اقتطاعه أو التفافه حسب حجم الجهاز (الصف رقم %lld)
de: Ein weiterer sehr langer Zeilentitel, um zu sehen, ob der Text je nach Gerätegröße abgeschnitten oder umbrochen wird (Zeile #%lld)
es: Otro título de fila muy largo para ver si el texto se trunca o se ajusta según el tamaño del dispositivo (Fila n.º %lld)
fr: Un autre titre de ligne très long pour voir si le texte est tronqué ou enveloppé selon la taille de l'appareil (Ligne n°%lld)
he: עוד כותרת שורה ארוכה מאוד כדי לראות אם הטקסט נקטע או גולש בהתאם לגודל המכשיר (שורה מס' %lld)

source: Button With An Extremely, Almost Ridiculously Long Label For Maximum UI Truncation Testing
ar: زر بتسمية طويلة للغاية وشبه سخيفة لأقصى اختبار لاقتطاع واجهة المستخدم
de: Schaltfläche mit einer extrem, fast lächerlich langen Beschriftung für maximales UI-Abschneide-Testen
es: Botón con una etiqueta extremadamente, casi ridículamente larga para pruebas máximas de truncamiento de IU
fr: Bouton avec une étiquette extrêmement, presque ridiculement longue pour un test maximal de troncature de l'interface
he: כפתור עם תווית ארוכה במיוחד, כמעט מגוחכת, לבדיקת קיטוע מקסימלית של ממשק המשתמש

source: Detail View Title With A Title That Overflows The Usual Width Of The Navigation Bar
ar: عنوان عرض التفاصيل بعنوان يفيض عن العرض المعتاد لشريط التنقل
de: Detailansichtstitel mit einem Titel, der die übliche Breite der Navigationsleiste überläuft
es: Título de vista detallada con un título que desborda el ancho habitual de la barra de navegación
fr: Titre de la vue détaillée avec un titre qui déborde de la largeur habituelle de la barre de navigation
he: כותרת תצוגת פרטים עם כותרת שגולשת מעבר לרוחב הרגיל של סרגל הניווט

source: Detail: Overly Long Navigation Title
ar: تفاصيل: عنوان تنقل طويل جداً
de: Detail: Übermäßig langer Navigationstitel
es: Detalle: Título de navegación excesivamente largo
fr: Détail : Titre de navigation excessivement long
he: פרטים: כותרת ניווט ארוכה מדי

source: Dismiss This Incredibly Long Button Title For The Alert
ar: تجاهل عنوان الزر الطويل بشكل لا يصدق للتنبيه
de: Diesen unglaublich langen Schaltflächentitel für die Warnung verwerfen
es: Descartar este título de botón increíblemente largo para la alerta
fr: Ignorer ce titre de bouton incroyablement long pour l'alerte
he: בטל את כותרת הכפתור הארוכה להפליא הזו עבור ההתראה

source: Dismiss This Sheet With A Very Long Button Title For Fun
ar: تجاهل هذه الورقة بعنوان زر طويل جداً للمتعة
de: Dieses Blatt mit einem sehr langen Schaltflächentitel zum Spaß verwerfen
es: Descartar esta hoja con un título de botón muy largo por diversión
fr: Fermer cette feuille avec un titre de bouton très long pour le plaisir
he: בטל את הגיליון הזה עם כותרת כפתור ארוכה מאוד בשביל הכיף

source: Form Section With A Comedically Long Header Title That Is Bound To Cause Truncation
ar: قسم نموذج بعنوان رأس طويل بشكل كوميدي لا بد أن يسبب اقتطاعاً
de: Formularabschnitt mit einem komisch langen Überschriftentitel, der zwangsläufig zum Abschneiden führt
es: Sección de formulario con un título de encabezado cómicamente largo que seguramente causará truncamiento
fr: Section de formulaire avec un titre d'en-tête comiquement long qui est voué à provoquer une troncature
he: מדור טופס עם כותרת ראש ארוכה בצורה קומית שבוודאי תגרום לקיטוע

source: Hello World!
ar: مرحبا بالعالم
de: Hallo Welt
es: Hola Mundo
fr: Bonjour le monde
he: שלום עולם

source: Here is some very, very, very, very, very, very, very, very, very, very, very long detail text that will probably need to wrap or get truncated depending on the available space.
ar: إليك بعض نصوص التفاصيل الطويلة جداً جداً جداً جداً جداً التي ستحتاج على الأرجح إلى الالتفاف أو الاقتطاع حسب المساحة المتوفرة.
de: Hier ist ein sehr, sehr, sehr, sehr, sehr, sehr, sehr langer Detailtext, der je nach verfügbarem Platz wahrscheinlich umbrechen oder abgeschnitten werden muss.
es: Aquí hay un texto de detalle muy, muy, muy, muy, muy, muy, muy, muy, muy largo que probablemente necesitará ajustarse o truncarse según el espacio disponible.
fr: Voici un texte de détail très, très, très, très, très, très, très, très, très, très, très long qui devra probablement s'enrouler ou être tronqué selon l'espace disponible.
he: הנה טקסט פרטים ארוך מאוד, מאוד, מאוד, מאוד, מאוד, מאוד, מאוד, מאוד, שבטח יצטרך לגלוש או להיקטע בהתאם למקום הפנוי.

source: Label With An Absurdly, Unnecessarily, Incredibly Long Title That Is Definitely Too Long For Comfort
ar: تسمية بعنوان طويل بشكل سخيف وغير ضروري ولا يصدق وهو بالتأكيد طويل جداً للراحة
de: Label mit einem absurd, unnötig, unglaublich langen Titel, der definitiv zu lang für den Komfort ist
es: Etiqueta con un título absurda, innecesaria e increíblemente largo que definitivamente es demasiado largo para ser cómodo
fr: Étiquette avec un titre absurdement, inutilement et incroyablement long qui est définitivement trop long pour être confortable
he: תווית עם כותרת ארוכה באופן אבסורדי, מיותר ובלתי יאמן שהיא בהחלט ארוכה מדי לנוחות

source: List Tab With A Ridiculously Long Tab Title To See What Happens When Text Overflows
ar: علامة تبويب القائمة بعنوان طويل بشكل سخيف لمعرفة ما يحدث عندما يفيض النص
de: Listentab mit einem lächerlich langen Tab-Titel, um zu sehen, was passiert, wenn der Text überläuft
es: Pestaña de lista con un título ridículamente largo para ver qué sucede cuando el texto se desborda
fr: Onglet de liste avec un titre ridiculement long pour voir ce qui se passe lorsque le texte déborde
he: כרטיסיית רשימה עם כותרת מגוחכת באורכה כדי לראות מה קורה כשהטקסט גולש

source: ListDemo With A Navigation Title That Is Far Too Long For Its Own Good
ar: عرض القائمة بعنوان تنقل طويل جداً أكثر مما ينبغي
de: Listendemo mit einem Navigationstitel, der viel zu lang für sein eigenes Wohl ist
es: Demostración de lista con un título de navegación que es demasiado largo para su propio bien
fr: Démo de liste avec un titre de navigation qui est beaucoup trop long pour son propre bien
he: הדגמת רשימה עם כותרת ניווט שהיא ארוכה מדי לטובתה האישית

source: Miscellaneous Tab With A Ridiculously Long Navigation Title That Should Be Truncated
ar: علامة تبويب متنوعة بعنوان تنقل طويل بشكل سخيف يجب اقتطاعه
de: Verschiedenes-Tab mit einem lächerlich langen Navigationstitel, der abgeschnitten werden sollte
es: Pestaña Miscelánea con un título de navegación ridículamente largo que debería truncarse
fr: Onglet divers avec un titre de navigation ridiculement long qui devrait être tronqué
he: כרטיסיית שונות עם כותרת ניווט מגוחכת באורכה שצריכה להיקטע

source: Miscellaneous UI Tab With Yet Another Very Long String Title Example
ar: علامة تبويب واجهة مستخدم متنوعة مع مثال آخر لعنوان سلسلة طويل جداً
de: Verschiedenes-UI-Tab mit noch einem weiteren sehr langen Zeichenfolgen-Titel-Beispiel
es: Pestaña de interfaz de usuario miscelánea con otro ejemplo de título de cadena muy largo
fr: Onglet d'interface utilisateur divers avec encore un autre exemple de titre de chaîne très long
he: כרטיסיית ממשק משתמש שונה עם עוד דוגמה לכותרת מחרוזת ארוכה מאוד

source: Navigation Tab With An Extremely Long Title To Test Truncation Behavior In Tab Bar
ar: علامة تبويب التنقل بعنوان طويل للغاية لاختبار سلوك الاقتطاع في شريط علامات التبويب
de: Navigationstab mit einem extrem langen Titel, um das Abschneideverhalten in der Tab-Leiste zu testen
es: Pestaña de navegación con un título extremadamente largo para probar el comportamiento de truncamiento en la barra de pestañas
fr: Onglet de navigation avec un titre extrêmement long pour tester le comportement de troncature dans la barre d'onglets
he: כרטיסיית ניווט עם כותרת ארוכה במיוחד לבדיקת התנהגות קיטוע בסרגל הכרטיסיות

source: Push: This Is A Very Long Navigation Link That Will Likely Be Truncated In The List Row
ar: دفع: هذا رابط تنقل طويل جداً ومن المحتمل أن يتم اقتطاعه في صف القائمة
de: Push: Dies ist ein sehr langer Navigationslink, der wahrscheinlich in der Listenzeile abgeschnitten wird
es: Push: Este es un enlace de navegación muy largo que probablemente se truncará en la fila de la lista
fr: Push : Ceci est un lien de navigation très long qui sera probablement tronqué dans la ligne de la liste
he: דחיפה: זהו קישור ניווט ארוך מאוד שסביר להניח שיקוצר בשורת הרשימה

source: Row #%lld: This Is An Excessively Verbose And Unreasonably Long Piece Of Text Used As A List Row Title
ar: الصف رقم %lld: هذا جزء من النص مطول بشكل مفرط وطويل بشكل غير معقول يستخدم كعنوان لصف القائمة
de: Zeile #%lld: Dies ist ein übermäßig wortreicher und unvernünftig langer Text, der als Listenzeilentitel verwendet wird
es: Fila n.º %lld: Este es un texto excesivamente detallado e irrazonablemente largo utilizado como título de fila de lista
fr: Ligne n°%lld : Ceci est un texte excessivement verbeux et déraisonnablement long utilisé comme titre de ligne de liste
he: שורה מס' %lld: זוהי פיסת טקסט ארכנית בצורה מוגזמת וארוכה באופן לא סביר המשמשת ככותרת שורת רשימה

source: Section Header With A Title That Is Absurdly, Excessively, And Almost Comically Long
ar: رأس قسم بعنوان طويل بشكل سخيف ومفرط وكوميدي تقريباً
de: Abschnittsüberschrift mit einem Titel, der absurd, übermäßig und fast komisch lang ist
es: Encabezado de sección con un título que es absurda, excesiva y casi cómicamente largo
fr: En-tête de section avec un titre qui est absurdement, excessivement et presque comiquement long
he: כותרת מדור עם כותרת שהיא ארוכה באופן אבסורדי, מוגזם וכמעט קומי

source: Sheet Title With An Obscenely Long String That Probably Won't Fit On One Line
ar: عنوان ورقة بسلسلة طويلة بشكل فاحش ربما لن تتناسب مع سطر واحد
de: Blatttitel mit einer obszön langen Zeichenfolge, die wahrscheinlich nicht in eine Zeile passt
es: Título de la hoja con una cadena obscenamente larga que probablemente no cabrá en una línea
fr: Titre de la feuille avec une chaîne obscènement longue qui ne tiendra probablement pas sur une ligne
he: כותרת גיליון עם מחרוזת ארוכה בצורה גסה שכנראה לא תיכנס בשורה אחת

source: Show Alert With Extremely Long Text That Will Most Certainly Not Fit On One Line, So We Can See How Alerts Handle It
ar: إظهار تنبيه بنص طويل للغاية لن يتناسب بالتأكيد مع سطر واحد، حتى نتمكن من رؤية كيفية تعامل التنبيهات معه
de: Zeige Warnung mit extrem langem Text, der sicherlich nicht in eine Zeile passt, damit wir sehen können, wie Warnungen damit umgehen
es: Mostrar alerta con texto extremadamente largo que con toda seguridad no cabrá en una línea, para ver cómo lo manejan las alertas
fr: Afficher une alerte avec un texte extrêmement long qui ne tiendra certainement pas sur une ligne, pour voir comment les alertes le gèrent
he: הצג התראה עם טקסט ארוך במיוחד שבוודאות לא ייכנס בשורה אחת, כדי שנוכל לראות איך התראות מתמודדות עם זה

source: This Is An Alert With A Ludicrously Long Title That Will Probably Get Truncated, Especially On Small Screens
ar: هذا تنبيه بعنوان طويل بشكل مضحك ومن المحتمل أن يتم اقتطاعه، خاصة على الشاشات الصغيرة
de: Dies ist eine Warnung mit einem lächerlich langen Titel, der wahrscheinlich abgeschnitten wird, besonders auf kleinen Bildschirmen
es: Esta es una alerta con un título ridículamente largo que probablemente se truncará, especialmente en pantallas pequeñas
fr: Ceci est une alerte avec un titre ridiculement long qui sera probablement tronqué, surtout sur les petits écrans
he: זוהי התראה עם כותרת ארוכה בצורה מגוחכת שכנראה תיקטע, במיוחד במסכים קטנים

source: This is the content of a sheet with a very, very, very, very, very, very, very, very long string inside it.
ar: هذا هو محتوى ورقة بسلسلة طويلة جداً جداً جداً جداً جداً بداخلها.
de: Dies ist der Inhalt eines Blattes mit einer sehr, sehr, sehr, sehr, sehr langen Zeichenfolge darin.
es: Este es el contenido de una hoja con una cadena muy, muy, muy, muy, muy, muy, muy, muy larga dentro.
fr: Ceci est le contenu d'une feuille avec une chaîne très, très, très, très, très, très, très, très longue à l'intérieur.
he: זהו תוכן של גיליון עם מחרוזת ארוכה מאוד, מאוד, מאוד, מאוד, מאוד, מאוד, מאוד בתוכו.

source: This Is The Navigation Demo With A Navigation Title That Is Way Too Long To Fit
ar: هذا هو العرض التوضيحي للتنقل بعنوان تنقل طويل جداً بحيث لا يمكن استيعابه
de: Dies ist die Navigationsdemo mit einem Navigationstitel, der viel zu lang ist, um zu passen
es: Esta es la demostración de navegación con un título de navegación que es demasiado largo para caber
fr: Ceci est la démo de navigation avec un titre de navigation qui est bien trop long pour tenir
he: זוהי הדגמת הניווט עם כותרת ניווט שהיא ארוכה מכדי להיכנס למקום

source: ToolbarItem With Another Incredibly Long Title To Check Truncation
ar: عنصر شريط الأدوات بعنوان طويل بشكل لا يصدق للتحقق من الاقتطاع
de: Symbolleistenelement mit einem weiteren unglaublich langen Titel, um das Abschneiden zu überprüfen
es: Elemento de barra de herramientas con otro título increíblemente largo para verificar el truncamiento
fr: Élément de barre d'outils avec un autre titre incroyablement long pour vérifier la troncature
he: פריט סרגל כלים עם כותרת ארוכה להפליא לבדיקת קיטוע

source: ToolbarItem With Another Outrageously Long String To Test Truncation Behavior In The Toolbar
ar: عنصر شريط الأدوات بسلسلة أخرى طويلة بشكل شنيع لاختبار سلوك الاقتطاع في شريط الأدوات
de: Symbolleistenelement mit einer weiteren unverschämt langen Zeichenfolge, um das Abschneideverhalten in der Symbolleiste zu testen
es: Elemento de barra de herramientas con otra cadena escandalosamente larga para probar el comportamiento de truncamiento
fr: Élément de barre d'outils avec une autre chaîne outrageusement longue pour tester le comportement de troncature
he: פריט סרגל כלים עם מחרוזת ארוכה שערורייתית נוספת לבדיקת התנהגות קיטוע בסרגל הכלים

source: Type here: This is a very, very, very, very, very, very, very, very, very long placeholder!
ar: اكتب هنا: هذا عنصر نائب طويل جداً جداً جداً جداً جداً!
de: Hier tippen: Dies ist ein sehr, sehr, sehr, sehr, sehr langer Platzhalter!
es: Escribe aquí: ¡Este es un marcador de posición muy, muy, muy, muy, muy largo!
fr: Tapez ici : C'est un espace réservé très, très, très, très, très, très, très, très, très long !
he: הקלד כאן: זהו שומר מקום ארוך מאוד, מאוד, מאוד, מאוד, מאוד!
